---
kind: type
id: T:Autodesk.Revit.Exceptions.IOException
source: html/30d0cc9b-741e-7695-4f52-d9d747791ec3.htm
---
# Autodesk.Revit.Exceptions.IOException

The exception that is thrown when an I/O error occurs.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class IOException : ApplicationException
```